/* No comment provided by engineer. */
"%1$@ could not be parsed because an invalid JSON dictionary was provided for key path \"%2$@\"" = "%1$@ could not be parsed because an invalid JSON dictionary was provided for key path \"%2$@\"";

/* No comment provided by engineer. */
"%1$@ could not be parsed because its entity attribute mapping contains illegal property keys." = "%1$@ could not be parsed because its entity attribute mapping contains illegal property keys.";

/* No comment provided by engineer. */
"%@ could not be created because an invalid JSON array was provided: %@" = "%1$@ could not be created because an invalid JSON array was provided: %2$@";

/* No comment provided by engineer. */
"%@ could not be created because an invalid JSON dictionary was provided: %@" = "%1$@ could not be created because an invalid JSON dictionary was provided: %2$@";

/* No comment provided by engineer. */
"Could not deserialize managed object" = "Could not deserialize managed object";

/* No comment provided by engineer. */
"Could not parse JSON" = "Could not parse JSON";

/* No comment provided by engineer. */
"Could not serialize managed object" = "Could not serialize managed object";

/* No comment provided by engineer. */
"Failed to fetch a managed object for uniqing predicate \"%@\"." = "Failed to fetch a managed object for uniqing predicate \"%@\".";

/* No comment provided by engineer. */
"Failed to initialize a managed object from entity named \"%@\"." = "Failed to initialize a managed object from entity named \"%@\".";

/* No comment provided by engineer. */
"Invalid entity attribute mapping" = "Invalid entity attribute mapping";

/* No comment provided by engineer. */
"Invalid JSON dictionary" = "Invalid JSON dictionary";

/* No comment provided by engineer. */
"Missing JSON array" = "Missing JSON array";

/* No comment provided by engineer. */
"Missing JSON dictionary" = "Missing JSON dictionary";

/* No comment provided by engineer. */
"No model class could be found to deserialize the object." = "No model class could be found to deserialize the object.";

/* No comment provided by engineer. */
"No model class could be found to parse the JSON dictionary." = "No model class could be found to parse the JSON dictionary.";

/* No comment provided by engineer. */
"No property by name \"%@\" exists on the entity." = "No property by name \"%@\" exists on the entity.";

/* No comment provided by engineer. */
"Property descriptions of class %@ are unsupported." = "Property descriptions of class %@ are unsupported.";

/* No comment provided by engineer. */
"Property of class %@ cannot be encoded into a to-many relationship." = "Property of class %@ cannot be encoded into a to-many relationship.";

/* No comment provided by engineer. */
"Property of class %@ cannot be encoded into an NSManagedObject." = "Property of class %@ cannot be encoded into an NSManagedObject.";

